Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_4.tmx
Source language: de
Languages: en

source: Wasserdichte Stoffe für die Herstellung von Hosen
en: Waterproof fabrics for use in the manufacture of trousers

source: Stoffe als textile Stückwaren zur Verwendung in der Fertigung
en: Fabrics being textile piece goods for use in manufacture

source: Textilstoffe zur Herstellung von Bettlaken
en: Textile fabrics for use in the manufacture of sheets

source: Textilstoffe zur Herstellung von Handtüchern
en: Textile fabrics for use in the manufacture of towels

source: Textilstoffe zur Herstellung von Wandverkleidungen
en: Textile fabrics for use in the manufacture of wall coverings

source: Haushaltstücher zum Abtrocknen von Gläsern
en: Household cloths for drying glasses

source: Mischstoffe aus anorganischen Fasern
en: Inorganic fibre mixed fabrics

source: Aufgerollte Vliesstoffe zur Verwendung in der Produktion
en: Non-woven fabrics in the form of rolls for use in manufacture

source: Textiletiketten zum Identifizieren von Bettwäsche
en: Labels (Textile -) for identifying linen

source: Handtücher [Textilien], angepasst für Handtuchspender
en: Towelling [textile] adapted for use in dispensers

source: Möbelstoffe als Stückware
en: Furnishing fabrics in the piece

source: Gemusterte Textilwaren zum Besticken
en: Patterned textiles for use in embroidery

source: Fahnen aus Stoff oder Kunststoff
en: Flags of textile or plastic

source: Dampfdurchlässige Textilwaren
en: Vapour permeable fabrics

source: Textilien zur Herstellung von Schiffssegeln
en: Textiles for use in the manufacture of ships sails

source: Textilwaren aus Satin
en: Textiles made of satin

source: Stoffbezüge für Toilettendeckel
en: Covers for toilet lids of fabric

source: Textilmaterialien zur Herstellung von Futterstoffe für Schuhwaren
en: Materials (Textile -) for use in the manufacture of linings for footwear

source: Textilmaterialien für die Herstellung von Sohlen
en: Materials (Textile -) for use in the manufacture of soles

source: Seidenstoffe, ausgenommen für Isolierzwecke
en: Fabrics made from silk, other than for insulation

source: Stoffe aus chemisch hergestellten Fasern, ausgenommen für Isolierzwecke
en: Fabrics of chemically produced fibres, other than for insulation

source: Chemiefaserstoffe in Form von textilen Stückwaren
en: Fabrics of man-made fibres being textile goods in piece form

source: Selbstklebende Stoffetiketten
en: Self-adhesive cloth labels

source: Kunstfaserstoffe [ausgenommen für Isolierzwecke]
en: Fabrics made from artificial fibres [other than for insulation]

source: Textile Stückwaren zur Herstellung von Bekleidung
en: Textile fabric piece goods for use in the manufacture of clothing

source: Textilstoffe für die Herstellung von Haushaltstextilwaren
en: Textile fabrics for making up into household textile articles

source: Textilstoffe zur Herstellung von Brieftaschen
en: Fabric for use in the manufacture of wallets

source: Steppdecken mit Polsterfüllstoffen
en: Quilts filled with stuffing materials

source: Wollstoffe
en: Woollen cloth

source: Stoffe in Form von Gardinen aus textilem Material
en: Drapes in the nature of curtains made of textile materials

source: Textilwaren zur Verwendung als Bettzeug
en: Textile goods for use as bedding

source: Mit Polyurethan beschichtete Textilwaren zur Herstellung von wasserdichter Bekleidung
en: Textile piece goods (Polyurethane coated -) for making waterproof clothing

source: Stoffe mit Kunststoffverstärkung
en: Plastic reinforced fabrics

source: Textile Stückwaren für den Haushalt
en: Household textile piece goods

source: Vliesstoffe als Umhüllung für Polstermaterial
en: Non-woven fabrics for use with paddings

source: Duschvorhänge aus feuerhemmendem Textilmaterial
en: Fire-retardant textile shower curtains

source: Textiletiketten zum Markieren von Bettwäsche
en: Labels (Textile -) for marking linen

source: Durch Wärme umformbare Vliesstoffe
en: Heat formable non-woven textile materials

source: Verstärkungsstoffe aus Vlies
en: Non-woven reinforcing fabrics

source: Bettdecken mit Volants
en: Valanced bed covers

source: Textilien zur Herstellung von Kopftüchern und Jaschmaks
en: Fabrics of carbon fibre, other than for insulation

source: Kohlefasergewebe, ausgenommen für Isolierungszwecke
en: Fabrics of inorganic fibres, other than for insulation

source: Stoffe aus anorganischen Fasern, ausgenommen für Isolierzwecke
en: Woollen fabrics for use in the manufacture of jackets

source: Wollstoffe für die Jackenfertigung
en: Textile smallwares [table linen]

source: Textile Kurzwaren [Tischwäsche]
en: Knitted fabrics of chemical-fiber yarn

source: Mischgewebe auf der Basis von Baumwolle
en: Gummed cloth, other than for stationery purposes

source: Wattierte Wandbekleidungen aus textilem Material
en: Screen printing fabrics for the glass industry

source: Siebdrucktücher für die Glasindustrie
en: Sheets of sailcloth for screening

source: Spannstoffe für Polsterzwecke
en: Tensioning webbing for upholstery

source: Textilstoffe für die Herstellung von Decken
en: Textile fabrics for making into blankets

source: Beschichtete Stoffe zur Herstellung von Gepäckbehältnissen
en: Coated fabrics for use in the manufacture of luggage

source: Steppdecken mit Federfüllung
en: Quilts filled with feathers

source: Fensterabdeckungen [Vorhänge] aus textilem Material
en: Window covering products made of textile material

source: Bett- und Tischwäsche
en: Bed linen and table linen

source: Damast
en: Damask

source: Synthetische Textilwaren
en: Synthetic textile piece goods

source: Abschminktücher aus Stoff
en: Cloths for removing make-up

source: Textilwaren für Einrichtungszwecke
en: Textile piece goods for furnishing purposes

source: Textilwaren zur Herstellung von Bettbezügen
en: Textile piece goods for making bedding covers

source: Japanische Baumwollhandtücher [Tenugui]
en: Japanese cotton towels (tenugui)

source: Futterstoffe aus Vliesstoffen
en: Inlay materials of non-woven fabrics

source: Bettbezüge aus textilem Material
en: Nightdress cases of textile

source: Feuerfestes Textilstoffe
en: Flame resistant fabrics

source: Fleecestoffe aus Kopolymeren
en: Fleece made from copolymers

source: Fleecestoffe aus Polypropylen
en: Fleece made from polypropylene

source: Klebematerialien in Form von Textilaufklebern
en: Adhesive materials in the form of stickers [textile]

source: Bettdecken aus Baumwolle
en: Bed blankets made of cotton

source: Tischdecken aus Damast
en: Table covers of damask

source: Fertiggardinen aus Textilstoffen
en: Ready made curtains of textiles

source: Baumwollgewebe, ausgenommen für Isolierzwecke
en: Fabrics made from wool, other than for insulation

source: Waschlappen
en: Wash cloths

source: Brokate
en: Brocades

source: Moleskin [Stoff]
en: Moleskin [fabric]

source: Stoff aus halbsynthetischen Fasern
en: Semi-synthetic fiber fabrics

source: Bedruckte Textiletiketten
en: Printed textile labels

source: Stoffe zur Herstellung von Windeln
en: Fabrics for use in making diapers

source: Stoffe zur Herstellung von Jerseys
en: Fabrics for use in making jerseys

source: Baumwollstoffe, ausgenommen für Isolierzwecke
en: Fabrics made from cotton, other than for insulation

source: Gewebte Stoffe zur Herstellung von Bekleidung zur Nutzung in Reinräumen
en: Woven fabrics for use in the manufacture of clothing for use in clean rooms

source: Gewebte Leinenstoffe
en: Woven linen fabrics

source: Textilwaren aus Flanell
en: Textiles made of flannel

source: Stoff-Sets für die Herstellung von Steppdecken
en: Kit comprised of fabrics for making quilts

source: Textile Stückwaren zur Verwendung bei der Herstellung von Schutzbekleidung
en: Textile piece goods for use in the manufacture of protective clothing

source: Einwegbettwäsche aus Textilstoffen
en: Disposable bedding of textile

source: Frottiertücher
en: Turkish towel

source: Textile Abschminktücher, ausgenommen imprägniert mit Toilettepräparaten
en: Make-up removal cloths [textile], other than impregnated with toilet preparations

source: Stoffetiketten für textiles Gewebe
en: Markers [labels] of cloth for textile fabrics

source: Textilstoffe für die Herstellung von Bekleidung
en: Textile fabrics for the manufacture of clothing

source: Futterstoffe für Kopfbedeckungen
en: Fabric linings for headgear

source: Zwischenfutter aus Vliesstoffen
en: Interlinings made of non-woven fabrics

source: Elastische Strickstoffe für Turnbekleidung
en: Knitted elastic fabrics for gymnastic dresses

source: Elastische Strickstoffe für Damenunterbekleidung
en: Knitted elastic fabrics for ladies underwear

source: Wasserdichte Stoffe für die Herstellung von Handschuhen
en: Waterproof fabrics for use in the manufacture of gloves

source: Strickstoffe aus Seidengarn
en: Knitted fabrics of silk yarn

source: Strickstoffe aus Wollgarn
en: Knitted fabrics of wool yarn

source: Seidenstoffe für Druckschablonen
en: Silk fabrics for printing patterns

source: Toilettendeckelüberzüge [aus Stoff oder Stoffersatz]
en: Fitted toilet lid covers [made of fabric or fabric substitutes]

source: Chemiefaserstoffe für Wirkwaren
en: Chemical fibre loop knit fabrics

source: Chenille [Stoff]
en: Chenille fabric

source: Waschlappen für die Körperpflege [ausgenommen für medizinische Zwecke]
en: Cloths for washing the body [other than for medical use]

source: Vorhänge in Form von Gardinen aus Stoff
en: Drapes in the nature of curtains

source: Textilfahnen als Platzgedecke
en: Textile flags used for place settings

source: Tischbezüge aus Kunststoff
en: Table covers of plastic

source: Kunststofffolien zur Herstellung von Einmalbettwäsche
en: Foils of plastics for the manufacture of disposable linen

source: Strandtücher aus textilem Material
en: Towels [textile] for the beach

source: Markenetiketten aus textilem Material
en: Badges made of fabric material

source: Tücher [Laken]
en: Sheets [textile]

source: Vliesstoffe aus Naturfasern
en: Non-woven fabrics of natural fibres

source: Tüll für die Schneiderei
en: Tulle for dressmaking

source: Volants in Form von Textilvorhängen
en: Valances [textile draperies]

source: Filz für Papierhersteller
en: Felt for use by papermakers

source: Textilwaren aus Leinen
en: Textiles made of linen

source: Gewebte Stoffe zur Herstellung von Bekleidungsstücken
en: Woven fabrics for making up into articles of clothing

source: Strickstoffe aus Baumwollgarn
en: Knitted fabrics of cotton yarn

source: Schwammtücher für textile Zwecke
en: Sponge cloths for textile use

source: Textile Wandbekleidungen
en: Tapestries of textile

source: Stoffe als Futter für Bekleidungsstücke
en: Fabrics for use as linings in clothing

source: Stoffe zur Herstellung von Inkontinenzauflagen
en: Fabrics for use in making incontinence pads

source: Gewebte Stoffe für Sofas
en: Woven fabrics for sofas

source: Textil-Stückwaren aus Baumwolle
en: Textile piece goods made of cotton

source: Einwegbettwäsche aus Papier
en: Disposable bedding of paper

source: Nicht mit Kosmetika imprägnierte textile Abschminktücher
en: Make-up removal cloths [textile], other than impregnated with cosmetics

source: Kanevas für Teppiche und Stickereien
en: Canvas for tapestry or embroidery

source: Tücher aus gewebten Textilmaterialen für die Körperwäsche [ausgenommen für medizinische Zwecke)
en: Cloths of woven textile material for washing the body [other than for medical use]

source: Beschichtete Stoffe zur Herstellung von Lederwaren
en: Coated fabrics for use in the manufacture of leather goods

source: Beschichtete Stoffe zur Herstellung von Regenbekleidung
en: Coated fabrics for use in the manufacture of rainwear

source: Textile Verbundmaterialien
en: Composite textile materials

source: Stoffe mit Gummi- oder Kunststoffbeschichtung
en: Fabric coated with rubber or plastics

source: Moskitonetze
en: Mosquito nets

source: Textilersatzstoffe aus Kunststoff
en: Plastic material [substitute for fabrics]

source: Elastische Strickstoffe für Mieder
en: Knitted elastic fabrics for bodices

source: Elastische Strickstoffe für Sportbekleidung
en: Knitted elastic fabrics for sportswear

source: Gesponnene Vliesstoffe aus Polypropylen
en: Polypropylene spunbonded non-woven textile fabrics

source: Steppdecken mit Halbdaunenfüllung
en: Quilts filled with half down

source: Wasserdampfdurchlässige Textilien
en: Water vapour permeable textiles

source: Wasserdichte Stoffe für die Herstellung von Hüten
en: Waterproof fabrics for use in the manufacture of hats

source: Stoffe für die Herstellung von Gartenmöbeln
en: Fabrics for manufacturing garden furniture

source: Stoffsets zur Herstellung von Spielzeugmonstern
en: Fabrics for sale in kit form for making toy monsters

source: Getränkeuntersetzer als Tischwäsche
en: Drink coasters of table linen

source: Bettwäsche für Kinder
en: Infants' bed linen

source: Fleecestoffe aus Polyester
en: Fleece made from polyester

source: Laminierte textile Stückwaren mit isolierenden Eigenschaften
en: Laminated textile piece goods having insulating properties

source: Klebeetiketten aus Textilstoffen
en: Adhesive labels (Textile -)

source: Textilersatzstoffe aus synthetischen Materialien
en: Textile substitute materials made from synthetic materials

source: Gesichtswaschlappen in Form von Handschuhen
en: Face flannels in the form of gloves

source: Wasserundurchlässige, aber feuchtigkeitsdurchlässige Textilstoffe
en: Textiles impervious to water but permeable to moisture

source: Textilwaren aus Samt
en: Textiles made of velvet

source: Mit einer feuerfesten Appretur versehene Textilwaren
en: Textiles treated with a flame resistant finish

source: Fertiggardinen aus Kunststoffen
en: Ready made curtains of plastics

source: Verstärkte Textilstoffe
en: Reinforced fabrics [textile]

source: Textilmaterialien für die Herstellung von Einlegesohlen
en: Materials (Textile -) for use in the manufacture of insoles

source: Gewebe aus Nylon, ausgenommen für Isolierzwecke
en: Fabrics made from nylon, other than for insulation

source: Textilstoffe aus synthetischen Fasern und Naturfasern, ausgenommen für Isolierzwecke
en: Fabrics made of mixed synthetic and natural fibres, other than for insulation

source: Wandbekleidungen aus Seide
en: Wall hangings of silk

source: Inlett [Matratzentuch]
en: Ticks [mattress covers]

source: Seidenstoffe für Möbel
en: Silk fabrics for furniture

source: Acrylfaserstoffe, ausgenommen für Isolierzwecke
en: Fabrics made from acrylic, other than for insulation

source: Gewebte Textilien [Stoffe] mit schützenden Eigenschaften vor elektromagnetischer Strahlung
en: Woven textiles having protective properties against electromagnetic rays

source: Handgesponnene Seidenstoffe
en: Hand spun silk fabrics

source: Spitzenplatzdeckchen, nicht aus Papier
en: Lace table mats not made of paper

source: Textilstoffe für die Herstellung von Bettwäsche
en: Textile fabrics for making into linens

source: Textilstoffe für die Herstellung von Möbeln
en: Textile fabrics for use in the manufacture of furniture

source: Stoffe für orthetische Geräte
en: Fabric used for orthotic devices

source: Tüll
en: Tulle

source: Atmungsaktive wasserdichte Gewebe
en: Breathable waterproof fabrics

source: Glasfaserstoffe für Textilzwecke
en: Fibreglass fabrics for textile use

source: Bettbezüge
en: Duvet covers

source: Stoffe aus Mischfasern als textile Stückwaren
en: Fabrics being textile piece goods made of mixtures of fibres

source: Stoffe für die Herstellung von Planen
en: Fabrics for manufacturing tarpaulins

source: Breit gewebte technische Stoffe
en: Broad woven industrial fabrics

source: Mischgewebe aus Chemiefasern
en: Chemical fibre mixed fabrics

source: Schwammtücher [textile Stückwaren]
en: Sponge cloths [textile piece goods]

source: Stoffe für Anzüge [Textilien]
en: Suiting materials [textile]

source: Mit Gänsedaunen gefüllte Decken
en: Duvets filled with goose feathers

source: Elastische Webstoffe
en: Elastic woven material

source: Webstoffe aus Kunststoff für landwirtschaftliche Zwecke
en: Plastic woven textile materials for use in agriculture

source: Möbelüberzüge [nicht zugeschnitten]
en: Furniture coverings (unfitted)

source: Flammenhemmende Textilstoffe [nicht aus Asbest]
en: Flame retardant fabrics [other than asbestos]

source: Beflockte Stoffe
en: Flocked fabrics

source: Hitzebeständige Textilstoffe [nicht zu Isolierzwecken]
en: Heat resistant fabrics [other than for insulation]

source: Vliesstoffe aus synthetischen Fasern
en: Non-woven fabrics of synthetic fibres

source: Textilwaren aus Vlies
en: Non-woven textile articles

source: Faserstoffe zur Herstellung von Bekleidungsstücken
en: Fibre fabrics for use in the manufacture of articles of clothing

source: Faserstoffe zur Herstellung von Taschenauskleidungen
en: Fibre fabrics for use in the manufacture of linings of bags

source: Textilien als Fensterbekleidungen
en: Textiles in the form of window furnishings

source: Steppdecken mit synthetischen Polsterfüllstoffen
en: Quilts filled with synthetic stuffing materials

source: Entfernbare Textilüberzüge für elektronische Apparate [nicht angepasst oder eingeformt]
en: Removable covers of textile for electronic apparatus [not fitted or shaped]

source: Mit Harz imprägnierte Textilstoffe
en: Resin impregnated textile fabrics

source: Stoffe aus Polyester, ausgenommen für Isolierzwecke
en: Fabrics made from polyester, other than for insulation

source: Wollstoffe für Wirkwaren
en: Wool loop knit fabrics

source: Gewebte Stoffe für Sessel
en: Woven fabrics for armchairs

source: Gewebte Stoffe für Kissen
en: Woven fabrics for cushions

source: Webstoffe zur Herstellung von Bekleidungsstücken
en: Textiles for making up into articles of clothing

source: Dampfdurchlässige Kunststofftextilien
en: Vapour permeable plastic textile

source: Velours für Möbel
en: Velours for furniture

source: Stoffe aus regenerierten Fasergarnen
en: Regenerated fiber yarn fabrics

source: Nicht angepasste Möbelüberzüge aus Textilien und Kunststoffen
en: Coverings of textile and of plastic for furniture (unfitted)

source: Möbelüberzüge aus Textilien
en: Furniture coverings of textile

source: Filz
en: Felt

source: Textile Stückwaren zur Herstellung von Gardinen
en: Textile piece goods for making curtains

source: Textile Stückwaren zur Herstellung von Kissenbezügen
en: Textile piece goods for making cushion covers

source: Textilwaren zur Herstellung von Handtüchern
en: Textile piece goods for making-up into towels

source: Textilmaterialien zur Verwendung bei der Schuhwarenherstellung
en: Materials (Textile -) for use in the manufacture of footwear

source: Textilstoffe zur Herstellung von Gardinen
en: Textile fabrics for use in the manufacture of curtains

source: Textilstoffe für die Herstellung von Bettzeug
en: Textile fabrics for use in the manufacture of bedding

source: Textilhandtücher für Küchenzwecke
en: Towels [textile] for kitchen use

source: Bedruckte Textilwaren
en: Printed textile piece goods

source: Steppdecken [Decken]
en: Quilt bedding mats

source: Bettdecken aus Papier
en: Bed covers of paper

source: Bezüge aus textilem Material für Toiletten
en: Covers of textile for water closets

source: Stoffetiketten zur Befestigung an Bekleidungsstücken
en: Tags of textile for attachment to clothing

source: Stoffetiketten zur Befestigung an Wäsche
en: Tags of textile for attachment to linen

source: Matratzen- und Kopfkissenbezüge
en: Ticks (mattress and pillow coverings)

source: Vliesstoffe, überwiegend aus Papier
en: Non-woven fabrics made substantially of paper

source: Fähnchen aus Stoff oder Kunststoff
en: Bunting of textile or plastic

source: Vorhänge aus Kunststoff
en: Curtains of plastic

source: Stoffe aus organischen Fasern, ausgenommen für Isolierzwecke
en: Fabrics of organic fibres, other than for insulation

source: Webstoffe mit atmungsaktiver Polyurethanbeschichtung
en: Woven cloth with breathable polyurethane coating

source: Stoffe aus Hanfgarn
en: Hemp yarn fabrics

source: Wandplaketten aus Textilien
en: Wall plaques of textile

source: Banner aus Stoff oder Kunststoff
en: Banners of textile or plastic

source: Handtücher für Kinder
en: Children's towels

source: Konturierte Matratzenüberzüge
en: Contoured mattress covers

source: Grobgewebe [Sackleinen]
en: Haircloth [sackcloth]

source: Marabu [Stoff]
en: Marabouts [cloth]

source: Mit Insektizid behandelte Moskitonetze
en: Insecticide-treated mosquito nets

source: Tischläufer aus Stoff
en: Table runners of textile

source: Bettdecken
en: Bed blankets

source: Stoffe aus Keramikfasern, ausgenommen für Isolierzwecke
en: Fabrics woven from ceramic fibres, other than for insulation

source: Leinenwebstoffe, ausgenommen für Isolierzwecke
en: Fabrics made from linen, other than for insulation

source: Stoffe aus Naturfasern, ausgenommen für Isolierzwecke
en: Fabrics made from natural fibres, other than for insulation

source: Webstoffe für Lederimitationen
en: Woven fabrics imitating leather

source: Wärmeaktivierte klebende Stoffe
en: Heat-activated adhesive fabrics

source: Make-up-Tücher aus textilem Material
en: Make-up pads of textile for removing make-up

source: Textilstoffe für die Herstellung von Betten
en: Textile fabrics for use in the manufacture of beds

source: Tücher aus Vliesstoffen für die Körperwäsche [ausgenommen für medizinische Zwecke]
en: Cloths of non-woven textile material for washing the body [other than for medical use]

source: Beschichtete textile Webstoffe
en: Coated woven textile materials

source: Textilstoffe zur Herstellung von Damenoberbekleidung
en: Fabric for manufacturing women's outerwear

source: Gewebe [Stoffe] für die Herstellung von Taschen
en: Fabric for use in the manufacture of bags

source: Gewebe [Stoffe] für die Herstellung von Regenschirmen
en: Fabric for use in the manufacture of umbrellas

source: Futterstoffe für Bekleidung
en: Fabric linings for clothing

source: Drucktücher aus textilem Material
en: Printers' blankets of textile

source: Tücher als textile Stückwaren
en: Tissues being textile piece goods

source: Wasserdichte Stoffe für die Herstellung von Jacken
en: Waterproof fabrics for use in the manufacture of jackets

source: Gaze [Stoff]
en: Gauze [cloth]

source: Dekorationsstoffe als textile Stückwaren
en: Fabrics being textile piece goods for use in tapestry

source: Stuhllehnenüberwürfe [Textilartikel]
en: Chair backs [textile articles]

source: Stoffe aus Wollgarn
en: Wool yarn fabrics

source: Einwegtischtücher aus textilem Material
en: Disposable tablecloths of textile

source: Textilstoffe zur Herstellung von Sportbekleidung
en: Textile fabrics for use in the manufacture of sportswear

source: Textilfutter als Stückware
en: Textile linings in the piece

source: Textilstoffe als Fensterabdeckungen
en: Textile materials for use as window coverings

source: Stückwaren aus gewebtem Kunststoff
en: Piece goods made of woven plastic material

source: Zugeschnittene Vliesstoffe für Produktionszwecke
en: Non-woven fabrics in the form of blanks for use in manufacture

source: Wasserfeste textile Stückwaren
en: Waterproofed textile piece goods

source: Friese [textile Wandbehänge]
en: Friezes [textile wall hangings]

source: Wabenstoffe [Textilien]
en: Honeycomb materials [textiles]

source: Vliesstoffe in Form von Bögen zur Verwendung in der Fertigung
en: Non-woven fabrics in the form of sheeting for use in manufacture

source: Stoffe zur Herstellung von Bekleidung
en: Materials for use in making clothes

source: Antistatische mehrschichtige Stoffe
en: Multiple-ply antistatic fabrics

source: Ersetzbare Überzüge für Stühle [lose]
en: Replacement seat covers [loose] for furniture

source: Schutzüberzüge für Gartenmöbel
en: Loose covers for garden furniture
